# Achievement 4 Project (Region flag Data check and grouping)

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
path = r'Desktop/CF/Achievement 4/Instacart Basket Analysis/02 Data/Prepared Data/df_410_1.pkl'

In [3]:
path_orig =r'Desktop/CF/Achievement 4/Instacart Basket Analysis'

In [4]:
df= pd.read_pickle(os.path.join(path))

In [5]:
df.columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'orders_days_since_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', 'max_order', 'loyalty_flag', 'Average_order',
       'Spending_flag', 'median_order', 'Frequency_flag', 'First Name',
       'Last Name', 'Gender', 'State', 'Age', 'date_joined', 'Dependants',
       'Marital_Status', 'income', '_merge', 'Region_flag'],
      dtype='object')

In [6]:
df.groupby('Region_flag')['Spending_flag']

In [15]:
df.groupby('Region_flag').agg({'prices': ['sum']})

                  prices
                     sum
Region_flag
Midwest       96688105.8
Northwest     66199058.8
South        131739354.6
West          93972442.8

In [16]:
df.groupby('Region_flag').agg({'order_id': ['count']})

             order_id
                count
Region_flag
Midwest       7603810
Northwest     5728347
South        10801610
West          8300445

In [19]:
df_crosstab = pd.crosstab(df['Region_flag'], df['Spending_flag'], dropna = False)

In [20]:
df_crosstab.value_counts

<bound method DataFrame.value_counts of Spending_flag  High Spender  Low Spender
Region_flag
Midwest              156129      7447681
Northwest            108343      5620004
South                210182     10591428
West                 160807      8139638>

In [24]:
df['Frequency_flag'].value_counts()

Frequency_flag
Frequent customer        22814871
Regular customer          6929354
Non-frequent customer     2689987
Name: count, dtype: int64

In [26]:
df['Frequency_flag']

0                Regular customer
1                Regular customer
2                Regular customer
3                Regular customer
4                Regular customer
                    ...
32434207        Frequent customer
32434208    Non-frequent customer
32434209    Non-frequent customer
32434210    Non-frequent customer
32434211    Non-frequent customer
Name: Frequency_flag, Length: 32434212, dtype: object

In [5]:
df['Activity'] = df.groupby(['user_id'])['order_number'].transform(np.max)

/var/folders/ys/c00h737n045dn1bcd8vmxlrc0000gn/T/ipykernel_8793/3085125372.py:1: FutureWarning: The provided callable <function max at 0x10d2b58a0> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df['Activity'] = df.groupby(['user_id'])['order_number'].transform(np.max)

In [33]:
df.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,orders_days_since_order,product_id,add_to_cart_order,reordered,product_name,...,Last Name,Gender,State,Age,date_joined,Dependants,Marital_Status,income,Region_flag,Activity
0,2539329,1,1,2,8,0.0,196,1,0,Soda,...,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,South,10
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,South,10
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,South,10
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,South,10
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,South,10

In [32]:
df= df.drop(columns = ['_merge','low activity'])

In [37]:
df['Activity']

count    3.243421e+07
mean     3.305217e+01
std      2.515449e+01
min      3.000000e+00
25%      1.300000e+01
50%      2.600000e+01
75%      4.700000e+01
max      9.900000e+01
Name: Activity, dtype: float64

In [6]:
df_high = df[df['Activity']> 5]

32434203    26
32434204    26
32434205    26
32434206    26
32434207    26
Name: Activity, dtype: int64

In [10]:
df_high.to_pickle(os.path.join(path_orig, '02 Data','Prepared Data', '4.10_df_over_5'))